#+STARTUP: overview
#+TITLE: Pendents del site

* Docs interessants
- [[https://developers.google.com/search/docs/specialty/ecommerce/pagination-and-incremental-page-loading][Com tractar llistes paginades]]
* TODO Pensar i organitzar
:PROPERTIES:
:Effort:   10:00
:END:
:LOGBOOK:
CLOCK: [2024-11-03 dg. 16:30]--[2024-11-03 dg. 17:15] =>  0:45
CLOCK: [2024-10-31 dj. 16:48]--[2024-10-31 dj. 16:51] =>  0:03
:END:

* DONE Uns sol feed de RSS pel site en comptes de per pàgina
:LOGBOOK:
CLOCK: [2024-10-31 dj. 17:10]--[2024-10-31 dj. 17:25] =>  0:15
:END:

* TODO Continuar les traduccions i consolidació
* DONE Les metadades schema.org per les pagines de taxonomies
:PROPERTIES:
:ORDERED:  t
:END:
:LOGBOOK:
CLOCK: [2024-11-01 dv. 17:25]--[2024-11-01 dv. 17:34] =>  0:09
CLOCK: [2024-11-01 dv. 15:34]--[2024-11-01 dv. 17:02] =>  1:28
CLOCK: [2024-11-01 dv. 15:33]--[2024-11-01 dv. 15:33] =>  0:00
:END:
* DONE Pàgines principals de tags (categories)
:LOGBOOK:
CLOCK: [2024-10-31 dj. 23:01]--[2024-10-31 dj. 23:10] =>  0:09
CLOCK: [2024-10-31 dj. 17:25]--[2024-10-31 dj. 19:25] =>  2:00
:END:
Falten coses:
- Fer el mateix per a les categories
- Repensar la manera d'organitzar, si cal

* TODO Nous continguts
* DONE Generar i usar imatges petites pels índexs
* TODO Generar i usar variants d'imatge ràpides
* DONE Afegir estratègies prefetch
* TODO Review general de schema.org per enriquir
- https://web.dev/learn/performance/resource-hints
- https://addyosmani.com/blog/prefetching/
- Especialment per a la imatge de fons i las seguent pàgina quan hi ha
  paginació.
* TODO Imatges responsive
:LOGBOOK:
CLOCK: [2024-11-03 dg. 19:19]--[2024-11-03 dg. 19:28] =>  0:09
CLOCK: [2024-11-03 dg. 17:15]--[2024-11-03 dg. 18:31] =>  1:16
:END:
- https://cloudfour.com/thinks/responsive-images-101-definitions/
Breakings a: 767 (son 450), 1023, 1279 

* Resum de temps
#+BEGIN: clocktable :scope file
#+CAPTION: Clock summary at [2024-11-03 dg. 18:32]
| Headline                                |   Time |
|-----------------------------------------+--------|
| *Total time*                            | *6:05* |
|-----------------------------------------+--------|
| Pensar i organitzar                     |   0:48 |
| Uns sol feed de RSS pel site en...      |   0:15 |
| Les metadades schema.org per les...     |   1:37 |
| Pàgines principals de tags (categories) |   2:09 |
| Imatges responsive                      |   1:16 |
#+END:

